---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.IncorrectWallUsageWithAttachedStruct
source: html/d0687084-5388-60d1-dc22-9b2268b1b449.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.IncorrectWallUsageWithAttachedStruct Property

A structural framing element is attached to a wall whose Structural Usage is set to [Usage].

## Syntax (C#)
```csharp
public static FailureDefinitionId IncorrectWallUsageWithAttachedStruct { get; }
```